Model: "model"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input_1 (InputLayer)           [(None, 100)]        0           []                               
                                                                                                  
 embedding (Embedding)          (None, 100, 300)     13723500    ['input_1[0][0]']                
                                                                                                  
 spatial_dropout1d (SpatialDrop  (None, 100, 300)    0           ['embedding[0][0]']              
 out1D)                                                                                           
                                                                                                  
 bidirectional (Bidirectional)  (None, 100, 256)     330240      ['spatial_dropout1d[0][0]']      
                                                                                                  
 bidirectional_1 (Bidirectional  (None, 100, 128)    140544      ['spatial_dropout1d[0][0]']      
 )                                                                                                
                                                                                                  
 concatenate (Concatenate)      (None, 100, 384)     0           ['bidirectional[0][0]',          
                                                                  'bidirectional_1[0][0]']        
                                                                                                  
 global_average_pooling1d (Glob  (None, 384)         0           ['concatenate[0][0]']            
 alAveragePooling1D)                                                                              
                                                                                                  
 global_max_pooling1d (GlobalMa  (None, 384)         0           ['concatenate[0][0]']            
 xPooling1D)                                                                                      
                                                                                                  
 concatenate_1 (Concatenate)    (None, 768)          0           ['global_average_pooling1d[0][0]'
                                                                 , 'global_max_pooling1d[0][0]']  
                                                                                                  
 dropout (Dropout)              (None, 768)          0           ['concatenate_1[0][0]']          
                                                                                                  
 dense (Dense)                  (None, 100)          76900       ['dropout[0][0]']                
                                                                                                  
 dense_1 (Dense)                (None, 50)           5050        ['dense[0][0]']                  
                                                                                                  
 dense_2 (Dense)                (None, 1)            51          ['dense_1[0][0]']                
                                                                                                  
==================================================================================================
Total params: 14,276,285
Trainable params: 14,276,285
Non-trainable params: 0
__________________________________________________________________________________________________
