Model: "model"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 input_1 (InputLayer)        [(None, 100)]             0         
                                                                 
 embedding (Embedding)       (None, 100, 300)          13723500  
                                                                 
 dropout (Dropout)           (None, 100, 300)          0         
                                                                 
 conv1d (Conv1D)             (None, 100, 100)          120100    
                                                                 
 max_pooling1d (MaxPooling1D  (None, 25, 100)          0         
 )                                                               
                                                                 
 gru (GRU)                   (None, 25, 100)           60600     
                                                                 
 global_max_pooling1d (Globa  (None, 100)              0         
 lMaxPooling1D)                                                  
                                                                 
 dense (Dense)               (None, 1)                 101       
                                                                 
=================================================================
Total params: 13,904,301
Trainable params: 13,904,301
Non-trainable params: 0
_________________________________________________________________
