Model: "model"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input_1 (InputLayer)           [(None, 100)]        0           []                               
                                                                                                  
 embedding (Embedding)          (None, 100, 300)     13723500    ['input_1[0][0]']                
                                                                                                  
 spatial_dropout1d (SpatialDrop  (None, 100, 300)    0           ['embedding[0][0]']              
 out1D)                                                                                           
                                                                                                  
 reshape (Reshape)              (None, 100, 300, 1)  0           ['spatial_dropout1d[0][0]']      
                                                                                                  
 conv2d (Conv2D)                (None, 100, 1, 32)   9632        ['reshape[0][0]']                
                                                                                                  
 conv2d_1 (Conv2D)              (None, 99, 1, 32)    19232       ['reshape[0][0]']                
                                                                                                  
 conv2d_2 (Conv2D)              (None, 98, 1, 32)    28832       ['reshape[0][0]']                
                                                                                                  
 conv2d_3 (Conv2D)              (None, 97, 1, 32)    38432       ['reshape[0][0]']                
                                                                                                  
 conv2d_4 (Conv2D)              (None, 96, 1, 32)    48032       ['reshape[0][0]']                
                                                                                                  
 global_max_pooling2d (GlobalMa  (None, 32)          0           ['conv2d[0][0]']                 
 xPooling2D)                                                                                      
                                                                                                  
 global_max_pooling2d_1 (Global  (None, 32)          0           ['conv2d_1[0][0]']               
 MaxPooling2D)                                                                                    
                                                                                                  
 global_max_pooling2d_2 (Global  (None, 32)          0           ['conv2d_2[0][0]']               
 MaxPooling2D)                                                                                    
                                                                                                  
 global_max_pooling2d_3 (Global  (None, 32)          0           ['conv2d_3[0][0]']               
 MaxPooling2D)                                                                                    
                                                                                                  
 global_max_pooling2d_4 (Global  (None, 32)          0           ['conv2d_4[0][0]']               
 MaxPooling2D)                                                                                    
                                                                                                  
 concatenate (Concatenate)      (None, 160)          0           ['global_max_pooling2d[0][0]',   
                                                                  'global_max_pooling2d_1[0][0]', 
                                                                  'global_max_pooling2d_2[0][0]', 
                                                                  'global_max_pooling2d_3[0][0]', 
                                                                  'global_max_pooling2d_4[0][0]'] 
                                                                                                  
 dropout (Dropout)              (None, 160)          0           ['concatenate[0][0]']            
                                                                                                  
 dense (Dense)                  (None, 100)          16100       ['dropout[0][0]']                
                                                                                                  
 dense_1 (Dense)                (None, 50)           5050        ['dense[0][0]']                  
                                                                                                  
 dense_2 (Dense)                (None, 1)            51          ['dense_1[0][0]']                
                                                                                                  
==================================================================================================
Total params: 13,888,861
Trainable params: 165,361
Non-trainable params: 13,723,500
__________________________________________________________________________________________________
