Model: "model"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input_1 (InputLayer)           [(None, 100)]        0           []                               
                                                                                                  
 embedding (Embedding)          (None, 100, 300)     13723500    ['input_1[0][0]']                
                                                                                                  
 reshape (Reshape)              (None, 100, 300, 1)  0           ['embedding[0][0]']              
                                                                                                  
 conv2d (Conv2D)                (None, 98, 1, 32)    28832       ['reshape[0][0]']                
                                                                                                  
 conv2d_1 (Conv2D)              (None, 97, 1, 32)    38432       ['reshape[0][0]']                
                                                                                                  
 conv2d_2 (Conv2D)              (None, 96, 1, 32)    48032       ['reshape[0][0]']                
                                                                                                  
 global_max_pooling2d (GlobalMa  (None, 32)          0           ['conv2d[0][0]']                 
 xPooling2D)                                                                                      
                                                                                                  
 global_max_pooling2d_1 (Global  (None, 32)          0           ['conv2d_1[0][0]']               
 MaxPooling2D)                                                                                    
                                                                                                  
 global_max_pooling2d_2 (Global  (None, 32)          0           ['conv2d_2[0][0]']               
 MaxPooling2D)                                                                                    
                                                                                                  
 concatenate (Concatenate)      (None, 96)           0           ['global_max_pooling2d[0][0]',   
                                                                  'global_max_pooling2d_1[0][0]', 
                                                                  'global_max_pooling2d_2[0][0]'] 
                                                                                                  
 dense (Dense)                  (None, 1)            97          ['concatenate[0][0]']            
                                                                                                  
==================================================================================================
Total params: 13,838,893
Trainable params: 13,838,893
Non-trainable params: 0
__________________________________________________________________________________________________
