Model: "model"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input_1 (InputLayer)           [(None, 131)]        0           []                               
                                                                                                  
 input_2 (InputLayer)           [(None, 131)]        0           []                               
                                                                                                  
 tfmt5_encoder_model (TFMT5Enco  TFBaseModelOutput(l  277040256  ['input_1[0][0]',                
 derModel)                      ast_hidden_state=(N               'input_2[0][0]']                
                                one, 131, 768),                                                   
                                 hidden_states=None                                               
                                , attentions=None)                                                
                                                                                                  
 tf.__operators__.getitem (Slic  (None, 768)         0           ['tfmt5_encoder_model[0][0]']    
 ingOpLambda)                                                                                     
                                                                                                  
 dropout_49 (Dropout)           (None, 768)          0           ['tf.__operators__.getitem[0][0]'
                                                                 ]                                
                                                                                                  
 dense (Dense)                  (None, 768)          590592      ['dropout_49[0][0]']             
                                                                                                  
 dense_1 (Dense)                (None, 1)            769         ['dense[0][0]']                  
                                                                                                  
==================================================================================================
Total params: 277,631,617
Trainable params: 277,631,617
Non-trainable params: 0
__________________________________________________________________________________________________
