Model: "model"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input_1 (InputLayer)           [(None, 100)]        0           []                               
                                                                                                  
 embedding (Embedding)          (None, 100, 300)     13723500    ['input_1[0][0]']                
                                                                                                  
 conv1d (Conv1D)                (None, 100, 128)     38528       ['embedding[0][0]']              
                                                                                                  
 conv1d_1 (Conv1D)              (None, 99, 128)      76928       ['embedding[0][0]']              
                                                                                                  
 conv1d_2 (Conv1D)              (None, 98, 128)      115328      ['embedding[0][0]']              
                                                                                                  
 conv1d_3 (Conv1D)              (None, 96, 128)      192128      ['embedding[0][0]']              
                                                                                                  
 conv1d_4 (Conv1D)              (None, 95, 128)      230528      ['embedding[0][0]']              
                                                                                                  
 dropout (Dropout)              (None, 100, 128)     0           ['conv1d[0][0]']                 
                                                                                                  
 dropout_2 (Dropout)            (None, 99, 128)      0           ['conv1d_1[0][0]']               
                                                                                                  
 dropout_4 (Dropout)            (None, 98, 128)      0           ['conv1d_2[0][0]']               
                                                                                                  
 dropout_6 (Dropout)            (None, 96, 128)      0           ['conv1d_3[0][0]']               
                                                                                                  
 dropout_8 (Dropout)            (None, 95, 128)      0           ['conv1d_4[0][0]']               
                                                                                                  
 max_pooling1d (MaxPooling1D)   (None, 25, 128)      0           ['dropout[0][0]']                
                                                                                                  
 max_pooling1d_1 (MaxPooling1D)  (None, 24, 128)     0           ['dropout_2[0][0]']              
                                                                                                  
 max_pooling1d_2 (MaxPooling1D)  (None, 24, 128)     0           ['dropout_4[0][0]']              
                                                                                                  
 max_pooling1d_3 (MaxPooling1D)  (None, 24, 128)     0           ['dropout_6[0][0]']              
                                                                                                  
 max_pooling1d_4 (MaxPooling1D)  (None, 23, 128)     0           ['dropout_8[0][0]']              
                                                                                                  
 bidirectional (Bidirectional)  (None, 400)          396000      ['max_pooling1d[0][0]']          
                                                                                                  
 bidirectional_1 (Bidirectional  (None, 400)         396000      ['max_pooling1d_1[0][0]']        
 )                                                                                                
                                                                                                  
 bidirectional_2 (Bidirectional  (None, 400)         396000      ['max_pooling1d_2[0][0]']        
 )                                                                                                
                                                                                                  
 bidirectional_3 (Bidirectional  (None, 400)         396000      ['max_pooling1d_3[0][0]']        
 )                                                                                                
                                                                                                  
 bidirectional_4 (Bidirectional  (None, 400)         396000      ['max_pooling1d_4[0][0]']        
 )                                                                                                
                                                                                                  
 dropout_1 (Dropout)            (None, 400)          0           ['bidirectional[0][0]']          
                                                                                                  
 dropout_3 (Dropout)            (None, 400)          0           ['bidirectional_1[0][0]']        
                                                                                                  
 dropout_5 (Dropout)            (None, 400)          0           ['bidirectional_2[0][0]']        
                                                                                                  
 dropout_7 (Dropout)            (None, 400)          0           ['bidirectional_3[0][0]']        
                                                                                                  
 dropout_9 (Dropout)            (None, 400)          0           ['bidirectional_4[0][0]']        
                                                                                                  
 concatenate (Concatenate)      (None, 2000)         0           ['dropout_1[0][0]',              
                                                                  'dropout_3[0][0]',              
                                                                  'dropout_5[0][0]',              
                                                                  'dropout_7[0][0]',              
                                                                  'dropout_9[0][0]']              
                                                                                                  
 dense (Dense)                  (None, 2000)         4002000     ['concatenate[0][0]']            
                                                                                                  
 batch_normalization (BatchNorm  (None, 2000)        8000        ['dense[0][0]']                  
 alization)                                                                                       
                                                                                                  
 dense_1 (Dense)                (None, 1)            2001        ['batch_normalization[0][0]']    
                                                                                                  
==================================================================================================
Total params: 20,368,941
Trainable params: 20,364,941
Non-trainable params: 4,000
__________________________________________________________________________________________________
